---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireTypeSet.IsEmpty
source: html/56cd6363-57e0-77b0-b86e-309bec822dbb.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.